In [22]:
import numpy as np
import pandas as pd

In [23]:
df = pd.read_csv('housingdata.csv - housingdata.csv.csv')
df

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN
8  100009000.0           HP      21212           na        2  1800

### 2

In [24]:
df.columns

Index(['PID', 'STATE', 'PRICE', 'NUM_BEDROOMS', 'NUM_BATH', 'SQ_FT'], dtype='object')

In [25]:
for row in df.index:
    print(row ,end= ' ')

0 1 2 3 4 5 6 7 8

The below code is for converting any kind of non numeric value in columns having, only numric values by NaN.

In [26]:
# columns_to_convert = ['PID', 'PRICE', 'NUM_BEDROOMS', 'NUM_BATH', 'SQ_FT']
# df[columns_to_convert] = df[columns_to_convert].apply(pd.to_numeric, errors='coerce')

### 3(a)

In [27]:
No_of_states = df['STATE'].shape
No_of_states

(9,)

### 3(b)

In [28]:
unique_states = np.unique(df['STATE']).shape
unique_states

(6,)

### 4

In [29]:
na_nan_empty_values = []
for column in df.columns:
    for index, value in enumerate(df[column]):
        if pd.isna(value) or value == 'na' or value == '' or value == '--':
            na_nan_empty_values.append((index, column, value))
print(na_nan_empty_values)

[(4, 'PID', nan), (2, 'NUM_BEDROOMS', nan), (5, 'NUM_BEDROOMS', nan), (8, 'NUM_BEDROOMS', 'na'), (3, 'NUM_BATH', nan), (1, 'SQ_FT', '--'), (7, 'SQ_FT', nan)]

### 5

In [30]:
for i in na_nan_empty_values:
    if i[1] == 'NUM_BEDROOMS':
        df.drop(i[0],axis = 0,inplace= True)

In [31]:
df

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN

### 6

In [32]:
df['NUM_BATH'] = pd.to_numeric(df['NUM_BATH'], errors='coerce')
df['NUM_BATH'].ffill(axis = 0 , inplace = True)

### 7

In [33]:
df['SQ_FT'] = pd.to_numeric(df['SQ_FT'], errors= 'coerce')
df['SQ_FT'].fillna(df['SQ_FT'].mean(), inplace = True)
df

           PID        STATE      PRICE NUM_BEDROOMS  NUM_BATH   SQ_FT
0  100001000.0           MP     321654            3       1.0  1000.0
1  100002000.0  MAHARASHTRA      21325            3       1.5  1062.5
3  100004000.0           TN     321321            1       1.5   700.0
4          NaN           TN  589465645            3       2.0  1600.0
6  100007000.0        ASSAM    3222321            2       2.0   950.0
7  100008000.0           HP      23131            1       1.0  1062.5

### 8

In [34]:
df['SQ_FT'].sum()

6375.0

### 9

In [35]:
df['NUM_STORE'] = [1,1,1,1,1,1]
df

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
0,100001000.0,MP,321654,3,1.0,1000.0,1
1,100002000.0,MAHARASHTRA,21325,3,1.5,1062.5,1
3,100004000.0,TN,321321,1,1.5,700.0,1
4,NaN,TN,589465645,3,2.0,1600.0,1
6,100007000.0,ASSAM,3222321,2,2.0,950.0,1
7,100008000.0,HP,23131,1,1.0,1062.5,1

### 10

In [36]:
tn_df = df[df['STATE'] == 'TN']
tn_df

           PID STATE      PRICE NUM_BEDROOMS  NUM_BATH   SQ_FT  NUM_STORE
3  100004000.0    TN     321321            1       1.5   700.0          1
4          NaN    TN  589465645            3       2.0  1600.0          1

### 11

In [37]:
sq_df = df[df['SQ_FT'] > 1000]
sq_df

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
1,100002000.0,MAHARASHTRA,21325,3,1.5,1062.5,1
4,NaN,TN,589465645,3,2.0,1600.0,1
7,100008000.0,HP,23131,1,1.0,1062.5,1

### 12

In [38]:
new= df.iloc[0:3,0:3]
new

           PID        STATE   PRICE
0  100001000.0           MP  321654
1  100002000.0  MAHARASHTRA   21325
3  100004000.0           TN  321321

### 13

In [39]:
df['sq_per_ft'] = df['PRICE']/df['SQ_FT']

In [40]:
df['STATE'][df['sq_per_ft'].idxmax()]

'TN'